//  Подсистема "Абстрактный тип данных массив"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/adt-array
//  https://infostart.ru/1c/articles/1473034/

#Область ОписаниеПеременных

Перем Список;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// см. РаботаСМассивом.Массив
Функция Массив(НовыеЭлементы = Неопределено) Экспорт
	Если НовыеЭлементы = Неопределено Тогда
		Если ТипЗнч(Список) = Тип("Массив") Тогда
			Возврат ЭтотОбъект;
		КонецЕсли;		
		Список = РаботаСМассивом.Скопировать(Список);
		Возврат ЭтотОбъект;
	КонецЕсли;
	Список = РаботаСМассивом.Скопировать(НовыеЭлементы);
	Возврат ЭтотОбъект;
КонецФункции

Функция Установить(Элементы) Экспорт
	Список = Элементы;
	Возврат ЭтотОбъект;
КонецФункции

Функция ВМассив(Свернуть = Ложь) Экспорт
	Если ТипЗнч(Список) <> Тип("Массив") Тогда
		Массив();
	КонецЕсли;
	Если Свернуть Тогда
		Список = РаботаСМассивом.Свернуть(Список);
	КонецЕсли;
	Возврат Список;
КонецФункции

Функция ВСписокЗначений() Экспорт
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ВМассив());
	Возврат Список;
КонецФункции

Функция ВФиксированныйМассив() Экспорт
	Возврат Новый ФиксированныйМассив(ВМассив());
КонецФункции

Функция ВСтруктуру(ПолеКлюча = "Ключ", ПолеЗначения = "Значение") Экспорт
	Возврат РаботаСМассивом.ВСтруктуру(ВМассив(), ПолеКлюча, ПолеЗначения);
КонецФункции

Функция ВСоответствие(ПолеКлюча = "Ключ", ПолеЗначения = "Значение") Экспорт
	Возврат РаботаСМассивом.ВСоответствие(ВМассив(), ПолеКлюча, ПолеЗначения);
КонецФункции

Функция ОтобразитьСвойства(СоответствиеСвойств, ПутьОтображения = Неопределено) Экспорт
	Список = РаботаСМассивом.ОтобразитьСвойства(ВМассив(), СоответствиеСвойств, ПутьОтображения);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВставитьСвойство(Свойство, ВыражениеОтображения, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	Список = РаботаСМассивом.ВставитьСвойство(ВМассив(), Свойство, ВыражениеОтображения, Контекст, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВставитьСвойствоРекурсивно(Путь, ВыражениеОтображения) Экспорт
	Список = РаботаСМассивом.ВставитьСвойствоРекурсивно(ВМассив(), Путь, ВыражениеОтображения);
	Возврат ЭтотОбъект;
КонецФункции

//  flat
Функция Спрямить(Глубина = Неопределено) Экспорт
	Список = РаботаСМассивом.Спрямить(Список, Глубина);
	Возврат ЭтотОбъект;
КонецФункции

//  filter
Функция Отобрать(ВыражениеПредиката, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	Список = РаботаСМассивом.Отобрать(Список, ВыражениеПредиката, Контекст, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

//  find
Функция НайтиЭлемент(ВыражениеПредиката, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	Возврат РаботаСМассивом.НайтиЭлемент(Список, ВыражениеПредиката, Контекст, Параметры);
КонецФункции

// sortBy
// Пример:
//Фрукты = Общий.АТДМассив(СтрРазделить("вишня, арбузы, бананы", ", ", Ложь));
//Фрукты.Сортировать();
//Фрукты.ДляКаждого("Сообщить(Элемент)");// [арбузы, бананы, вишня]
// 
// Параметры:
//  ВыражениеПредиката - Строка
//  Контекст - Неопределено - Контекст
// 
// Возвращаемое значение:
//  ОбработкаОбъект.АТДМассив - Сортировать
Функция СортироватьПо(Поля) Экспорт
	РаботаСМассивом.СортироватьПо(Список, Поля);
	Возврат ЭтотОбъект;
КонецФункции

// sort
// Пример:
//Фрукты = Общий.АТДМассив(СтрРазделить("вишня, арбузы, бананы", ", ", Ложь));
//Фрукты.Сортировать();
//Фрукты.ДляКаждого("Сообщить(Элемент)");// [арбузы, бананы, вишня]
// 
// Параметры:
//  ВыражениеПредиката - Строка
//  Контекст - Неопределено - Контекст
// 
// Возвращаемое значение:
//  ОбработкаОбъект.АТДМассив - Сортировать
Функция Сортировать(ВыражениеПредиката = Неопределено, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	РаботаСМассивом.Сортировать(Список, ВыражениеПредиката, Контекст, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

Функция ОпределитьТопографическийПорядок(Ключ = "Идентификатор", СвойствоПодчиненныхЭлементов = "ПодчиненныеЭлементы", СвойствоПорядка = "Порядок", Словарь = Неопределено) Экспорт
	РаботаСМассивом.ОпределитьТопографическийПорядок(Список, Ключ, СвойствоПодчиненныхЭлементов, СвойствоПорядка, Словарь);
	Возврат ЭтотОбъект;
КонецФункции

// map
// 
// Параметры:
//  Выражение - Строка - Выражение функции
//  Контекст - Неопределено - Контекст
//  Параметры - Неопределено - Параметры
// 
// Возвращаемое значение:
//  ОбработкаОбъект.АТДМассив - Отобразить
Функция Отобразить(Выражение, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	Список = РаботаСМассивом.Отобразить(Список, Выражение, Контекст, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

// reduce
// 
// Параметры:
//  Выражение - Строка - Выражение функции
//  НачальноеЗначение - Неопределено - Начальное значение
//  Контекст - Неопределено - Контекст
//  Параметры - Неопределено - Параметры
// 
// Возвращаемое значение:
//  Произвольный - Преобразовать
Функция Преобразовать(Выражение, НачальноеЗначение = Неопределено, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	Возврат РаботаСМассивом.Преобразовать(Список, Выражение, НачальноеЗначение, Контекст, Параметры);
КонецФункции

//  pop
Функция Взять() Экспорт
	Возврат РаботаСМассивом.Взять(Список);
КонецФункции

//  push
Функция Положить(Элемент) Экспорт
	РаботаСМассивом.Положить(Список, Элемент);
	Возврат ЭтотОбъект;
КонецФункции

//  insert
Функция Вставить(Индекс, Элемент) Экспорт
	Список.Вставить(Индекс, Элемент);
	Возврат ЭтотОбъект;
КонецФункции

//  add
Функция Добавить(Элемент) Экспорт
	РаботаСМассивом.Добавить(Список, Элемент);
	Возврат ЭтотОбъект;
КонецФункции

//  slice
Функция Срез(НижняяГраница = 0, Знач ВерхняяГраница = Неопределено, Шаг = 1) Экспорт
	Список = РаботаСМассивом.Срез(Список, НижняяГраница, ВерхняяГраница, Шаг);
	Возврат ЭтотОбъект;
КонецФункции

#Если НЕ ВебКлиент Тогда

//  forEach
Функция ДляКаждого(Алгоритм, Контекст = Неопределено, Параметры = Неопределено) Экспорт
	РаботаСМассивом.ДляКаждого(Список, Алгоритм, Контекст, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

#КонецЕсли

// Устарела.
Функция ДополнитьМассив(МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	Дополнить(МассивИсточник, ТолькоУникальныеЗначения);
	Возврат ЭтотОбъект;
КонецФункции

Функция Дополнить(МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	Список = РаботаСМассивом.Дополнить(Список, МассивИсточник, ТолькоУникальныеЗначения);
	Возврат ЭтотОбъект;
КонецФункции

Функция Разность(МассивВычитания) Экспорт
	Список = РаботаСМассивом.Разность(Список, МассивВычитания);
	Возврат ЭтотОбъект;
КонецФункции

Функция Свернуть(ПоляГруппировки = Неопределено, ПоляСвертки = Неопределено) Экспорт
	Список = РаботаСМассивом.Свернуть(Список, ПоляГруппировки, ПоляСвертки);
	Возврат ЭтотОбъект;
КонецФункции

Функция Пустой() Экспорт
	Возврат Список.Количество() = 0;
КонецФункции

#КонецОбласти

#Область Инициализация

Список = Новый Массив;

#КонецОбласти