//  Подсистема "Абстрактный тип данных массив"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/adt-array
//  https://infostart.ru/1c/articles/1473034/

#Область ПрограммныйИнтерфейс

Функция Множество(Ключ = Неопределено) Экспорт
	_Множество = Новый Структура("Ключ, Словарь", Ключ, Новый Соответствие);
	Возврат _Множество;
КонецФункции

Процедура Дополнить(_Множество, Элементы) Экспорт
	Для Каждого Элемент Из Элементы Цикл
		Добавить(_Множество, Элемент);
	КонецЦикла;
КонецПроцедуры

//  add
Процедура Добавить(Множество, Элемент) Экспорт
	ЗначениеКлюча = ?(ЗначениеЗаполнено(Множество.Ключ), Элемент[Множество.Ключ], Элемент);
	Множество.Словарь.Вставить(ЗначениеКлюча, Элемент);
КонецПроцедуры

//  delete
Процедура Удалить(Множество, Элемент) Экспорт
	ЗначениеКлюча = ?(ЗначениеЗаполнено(Множество.Ключ), Элемент[Множество.Ключ], Элемент);
	Множество.Словарь.Удалить(ЗначениеКлюча);
КонецПроцедуры

//  has
Функция Содержит(Множество, Элемент) Экспорт
	ЗначениеКлюча = ?(ЗначениеЗаполнено(Множество.Ключ), Элемент[Множество.Ключ], Элемент);
	Возврат Множество.Словарь[ЗначениеКлюча] <> Неопределено;
КонецФункции

//  isEmpty
Функция Пустое(Множество) Экспорт
	Возврат НЕ ЗначениеЗаполнено(Множество.Словарь);
КонецФункции

#КонецОбласти