//@skip-check method-optional-parameter-before-required

//  Подсистема "Абстрактный тип данных массив"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/adt-array
//  https://infostart.ru/1c/articles/1473034/

#Область ПрограммныйИнтерфейс

// Множество - конструктор множества. Если требуется создать множествао на основании массива, 
// то используйте Дополнить(, Список)
// 
// Параметры:
//  Ключ - Строка - список полей ключа через запятую.
//                  Если не задан, то ключом будет сам элемент множества. 
//                  Имя поля ключа должно удовлетворять требованиям имен переменных
// 
// Возвращаемое значение:
//   - см. НовыйОписаниеМножества
Функция Множество(Ключ = Неопределено) Экспорт
	ОписаниеМножества = НовыйОписаниеМножества(Ключ);
	Возврат ОписаниеМножества;
КонецФункции

// Дополнить.
// 
// Параметры:
//  Множество - см. НовыйОписаниеМножества
//                    - Строка - ключ нового множества, которое будет создано
//                    - Неопределено - новое множество будет создано без ключа
//  Список - Массив из Произвольный - элементы для добавления во множество
// 
// Возвращаемое значение:
//   - см. НовыйОписаниеМножества
//   - Неопределено
Функция Дополнить(Знач Множество = Неопределено, Список) Экспорт
	
	Если Множество = Неопределено Тогда
		Множество = Множество();
	ИначеЕсли ТипЗнч(Множество) = Тип("Строка") Тогда
		Множество = Множество(Множество);
	КонецЕсли;
	
	Для Каждого Элемент Из Список Цикл
		Добавить(Множество, Элемент);
	КонецЦикла;
	
	Возврат Множество;
	
КонецФункции

// add
// 
// Параметры:
//  Множество - См. Множество
//  Элемент - Произвольный - новый элемент множества, если найден, то будет прочитан из множества
// 
// Возвращаемое значение:
//  Булево - Истина - элемент добавлен, Ложь - прочитан в Элемент
Функция Добавить(Множество, Элемент) Экспорт
	
	СоставКлюча = Множество.СоставКлюча;
	
	Если ЗначениеЗаполнено(СоставКлюча) Тогда
		
		Словарь = Множество.Словарь;
		
		Для Индекс = 0 По СоставКлюча.ВГраница() - 1 Цикл
			
			Ключ = СоставКлюча[Индекс];
			ЗначениеКлюча = Элемент[Ключ];
			ЭлементМножества = Словарь[ЗначениеКлюча];
			
			Если ЭлементМножества = Неопределено Тогда
				
				ЭлементМножества = Новый Соответствие;
				Словарь[ЗначениеКлюча] = ЭлементМножества;
				
			КонецЕсли;
			
			Словарь = ЭлементМножества;
			
		КонецЦикла;
		
		Ключ = СоставКлюча[СоставКлюча.ВГраница()];
		ЗначениеКлюча = Элемент[Ключ];
		Значение = Словарь[ЗначениеКлюча];
		
		Если Значение = Неопределено Тогда
			Словарь.Вставить(ЗначениеКлюча, Элемент);
			Возврат Истина;
		КонецЕсли;
		
		// Обновить входящий элемент ссылкой из словаря элементов множества
		Элемент = Значение;
		Возврат Ложь;
				
	КонецЕсли;
	
	Словарь = Множество.Словарь;
	ЗначениеКлюча = Элемент;
	Значение = Словарь[ЗначениеКлюча];
	
	Если Значение = Неопределено Тогда
		Словарь.Вставить(ЗначениеКлюча, Элемент);
		Возврат Истина;
	КонецЕсли;
	
	Элемент = Значение;
	Возврат Ложь;
	
КонецФункции

// delete
// 
// Параметры:
//  Множество - см. НовыйОписаниеМножества 
//  Элемент - Произвольный - 
Процедура Удалить(Множество, Элемент) Экспорт
	
	СоставКлюча = Множество.СоставКлюча;
	
	Если НЕ ЗначениеЗаполнено(СоставКлюча) Тогда
		Множество.Словарь.Удалить(Элемент);
		Возврат;
	КонецЕсли;
	
	СоставСловарей = Новый Массив;
	Словарь = Множество.Словарь;
	СоставСловарей.Добавить(Словарь);
	
	Для Индекс = 0 По СоставКлюча.ВГраница() - 1 Цикл
		
		Ключ = СоставКлюча[Индекс];
		ЗначениеКлюча = Элемент[Ключ];
		ЭлементМножества = Словарь[ЗначениеКлюча];
		
		Если ЭлементМножества = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Словарь = ЭлементМножества;
		СоставСловарей.Добавить(Словарь);
		
	КонецЦикла;
	
	Ключ = СоставКлюча[СоставКлюча.ВГраница()];
	ЗначениеКлюча = Элемент[Ключ];
	Словарь.Удалить(ЗначениеКлюча);
	
	Для Индекс = -СоставСловарей.ВГраница() По 0 Цикл
		
		Словарь = СоставСловарей[-Индекс];
		
		Если Словарь.Количество() > 1 Тогда
			Прервать;
		КонецЕсли;
		
		Словарь.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

// Элемент.
// 
// Параметры:
//  Множество - см. НовыйОписаниеМножества
//  Элемент - Произвольный
// 
// Возвращаемое значение:
//  Произвольный
Функция Элемент(Множество, Элемент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Множество.СоставКлюча) Тогда
		Возврат Множество.Словарь.Получить(Элемент);
	КонецЕсли;
	
	Словарь = Множество.Словарь;
	СоставКлюча = Множество.СоставКлюча;
	
	Для Индекс = 0 По СоставКлюча.ВГраница() - 1 Цикл
		
		Ключ = СоставКлюча[Индекс];
		ЗначениеКлюча = Элемент[Ключ];
		ЭлементМножества = Словарь[ЗначениеКлюча];
		
		Если ЭлементМножества = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Словарь = ЭлементМножества;
		
	КонецЦикла;
	
	Ключ = СоставКлюча[СоставКлюча.ВГраница()];
	ЗначениеКлюча = Элемент[Ключ];
	Значение = Словарь[ЗначениеКлюча];
	Возврат Значение;
	
КонецФункции

// has
// 
// Параметры:
//  Множество - см. НовыйОписаниеМножества
//  Элемент - Произвольный
//  Значение - Произвольный, Неопределено - если елемент есть, то возвращается он же, иначе Неопределено
// 
// Возвращаемое значение:
//  Булево - Содержит
Функция Содержит(Множество, Элемент, Значение = Неопределено) Экспорт
	
	Значение = Элемент(Множество, Элемент);
	Возврат Значение <> Неопределено;
	
КонецФункции

// isEmpty
// 
// Параметры:
//  Множество - см. Множество
// 
// Возвращаемое значение:
//  Булево - Пустое
Функция Пустое(Множество) Экспорт
	Возврат НЕ ЗначениеЗаполнено(Множество.Словарь);
КонецФункции

// Пересечение.
// 
// Параметры:
//  Множество1 - см. Множество
//  Множество2 - см. Множество
// 
// Возвращаемое значение:
//  см. Множество
Функция Пересечение(Множество1, Множество2) Экспорт
	
	Результат = Множество(Множество1.Ключ);
	
	Для Каждого КлючЗначение Из Множество1.Словарь Цикл
		
		Значение = КлючЗначение.Значение;
		
		Если НЕ Содержит(Множество2, Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Добавить(Результат, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разность.
// 
// Параметры:
//  Множество1 - см. Множество
//  Множество2 - см. Множество
// 
// Возвращаемое значение:
//  см. Множество
Функция Разность(Множество1, Множество2) Экспорт
	
	Результат = Множество(Множество1.Ключ);
	
	Для Каждого КлючЗначение Из Множество1.Словарь Цикл
		
		Значение = КлючЗначение.Значение;
		
		Если Содержит(Множество2, Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Добавить(Результат, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Объединение.
// 
// Параметры:
//  Множество1 - см. Множество
//  Множество2 - см. Множество
// 
// Возвращаемое значение:
//  см. Множество
Функция Объединение(Множество1, Множество2) Экспорт
	
	Результат = Множество(Множество1.Ключ);
	
	Для Каждого КлючЗначение Из Множество1.Словарь Цикл
		Добавить(Результат, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Массив.
// 
// Параметры:
//  Множество - см. Множество
// 
// Возвращаемое значение:
//  Массив из Произвольный
Функция Массив(Множество) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого КлючЗначение Из Множество.Словарь Цикл
		Результат.Добавить(КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый описание множества.
// 
// Параметры:
//  Ключ - Строка, Неопределено -
// 
// Возвращаемое значение:
//  Структура - Новый описание множества:
// * Ключ - Строка, Неопределено -
// * Словарь - Соответствие из Произвольный - 
// * СоставКлюча - Массив из Строка - 
//               - Неопределено - 
Функция НовыйОписаниеМножества(Ключ = Неопределено)
	ОписаниеМножества = Новый Структура;
	ОписаниеМножества.Вставить("Ключ", Неопределено);
	ОписаниеМножества.Вставить("Словарь", Новый Соответствие);
	ОписаниеМножества.Вставить("СоставКлюча", Неопределено);
	ОписаниеМножества.Ключ = Ключ;
	Если ТипЗнч(Ключ) = Тип("Строка") Тогда
		ОписаниеМножества.СоставКлюча = РаботаСМассивом.Массив(Ключ);
	КонецЕсли;
	Возврат ОписаниеМножества;
КонецФункции

#КонецОбласти
